---
kind: method
id: M:Autodesk.Revit.DB.DirectShape.RemoveAllReferenceObjects
source: html/33cfa8d2-806e-8ba0-ac10-f317ed42da6a.htm
---
# Autodesk.Revit.DB.DirectShape.RemoveAllReferenceObjects Method

Removes all reference objects (if any) from the DirectShape.

## Syntax (C#)
```csharp
public void RemoveAllReferenceObjects()
```